<a href="https://colab.research.google.com/github/MHaley206265/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/MATT_HALEY_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-18 02:58:31--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.185.173
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.185.173|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  96.8MB/s    in 2.0s

2020-03-18 02:58:33 (96.8 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
# imports
import pandas as pd
import numpy as np
# reading data sets into dataframes and looking at data
aisles_df = pd.read_csv('/content/instacart_2017_05_01/aisles.csv')
aisles_df.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [6]:
departments_df = pd.read_csv('/content/instacart_2017_05_01/departments.csv')
departments_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [7]:
order_products__prior_df = pd.read_csv('/content/instacart_2017_05_01/order_products__prior.csv')
print(order_products__prior_df.shape)
order_products__prior_df.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
order_products__train_df = pd.read_csv('/content/instacart_2017_05_01/order_products__train.csv')
print(order_products__train_df.shape)
order_products__train_df.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [9]:
orders_df = pd.read_csv('/content/instacart_2017_05_01/orders.csv')
orders_df.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [10]:
products_df = pd.read_csv('/content/instacart_2017_05_01/products.csv')
products_df.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [11]:
# In order to find the top 10 sold items, we will need 
# both order_products data sets and the products data set

# Concat datasets together:
order_products_df = pd.concat([order_products__prior_df, order_products__train_df], axis=0)
order_products_df.shape

(33819106, 4)

In [12]:
# Trimming order_products down to the columns we need
order_products_trim_df = order_products_df[['product_id',	'add_to_cart_order']]
order_products_trim_df.head()

   product_id  add_to_cart_order
0       33120                  1
1       28985                  2
2        9327                  3
3       45918                  4
4       30035                  5

In [13]:
# Trimming down products_df to only the columns we need
product_names = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach',
                'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']
products_trim_df = products_df[['product_id',	'product_name']]
condition_products = products_trim_df['product_name'].isin(product_names)
products_trim_df = products_trim_df[condition_products]
products_trim_df.head()

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana

In [14]:
# Merge the trimmed datasets
merged_products_df = pd.merge(order_products_trim_df, products_trim_df, on='product_id', how='inner')
print(merged_products_df.shape)
merged_products_df.head()

(2418314, 3)

   product_id  add_to_cart_order          product_name
0       21903                  4  Organic Baby Spinach
1       21903                  6  Organic Baby Spinach
2       21903                  3  Organic Baby Spinach
3       21903                  4  Organic Baby Spinach
4       21903                  8  Organic Baby Spinach

In [0]:
# Using the merged dataset to make a new data frame with just he top ten sold items
product_amounts = merged_products_df.groupby(['product_id'])['add_to_cart_order'].sum().sort_values(ascending=False).head(10)
product_amounts = pd.DataFrame(product_amounts)

In [37]:
# Fixing index on new dataframe
product_amounts.reset_index(inplace=True)
product_amounts

   product_id  add_to_cart_order
0       24852            2405664
1       13176            2007396
2       21137            2005999
3       21903            1870623
4       47209            1497887
5       47626            1279007
6       26209            1261016
7       47766            1187054
8       16797            1065577
9       27845             777566

In [40]:
# merging new dataframe to show the names of the products and then fixing a column name
product_amounts_final_df = pd.merge(product_amounts, products_trim_df, how='inner', on='product_id')
product_amounts_final_df.rename(columns={'add_to_cart_order' : 'total_orders'}, inplace=True)
product_amounts_final_df

   product_id  total_orders            product_name
0       24852       2405664                  Banana
1       13176       2007396  Bag of Organic Bananas
2       21137       2005999    Organic Strawberries
3       21903       1870623    Organic Baby Spinach
4       47209       1497887    Organic Hass Avocado
5       47626       1279007             Large Lemon
6       26209       1261016                   Limes
7       47766       1187054         Organic Avocado
8       16797       1065577            Strawberries
9       27845        777566      Organic Whole Milk

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [17]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [43]:
# table2 -> tidy
column_names = table2.columns.tolist()
index_values = table2.index.tolist()
table_two = table2.reset_index()
tidy = table_two.melt(id_vars = 'index',
                      value_vars = column_names)
tidy.rename(columns={'index' : 'trt', 'variable' : 'person'}, inplace=True)
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

  trt        person  value
0   a    John Smith    NaN
1   b    John Smith    2.0
2   a      Jane Doe   16.0
3   b      Jane Doe   11.0
4   a  Mary Johnson    3.0
5   b  Mary Johnson    1.0

In [44]:
# tidy -> table2
wide_table2 = tidy.pivot_table(index='trt',
                               columns='person',
                               values='value')
wide_table2

person  Jane Doe  John Smith  Mary Johnson
trt
a           16.0         NaN           3.0
b           11.0         2.0           1.0

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [49]:
# Flights Pivot Table
flights.head()
flights_pivot = flights.pivot_table(index='year',
                                    columns='month',
                                    values='passengers')
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####